# SF Salaries Exercise 

Welcome to a mini project for you to practice your pandas skills! We will be using the SF Salaries Dataset! Just follow along and complete the tasks outlined below. The tasks will get harder and harder as you go along.

    Note: Look for reading a .csv file using pandas on your own, it's very basic and straight forward

** Import pandas as pd.**

In [1]:
# Your code code here

** Read Salaries.csv as a dataframe called sal.**

In [3]:
# Your code code here
import pandas as pd
sal = pd.read_csv("Salaries.csv")
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Check the head of the DataFrame. **

In [3]:
# Your code code here

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [4]:
# Your code code here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [5]:
sal['BasePay'].mean()

66325.44884050643

In [5]:
# Your code code here

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [8]:
sal['OvertimePay'].max()

245131.88

In [6]:
# Your code code here

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [9]:
sal.loc[24,'JobTitle']

'CAPTAIN, FIRE SUPPRESSION'

In [28]:
df2 = sal[sal['EmployeeName'].str.contains("JOSEPH DRISCOLL")]
df2['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [7]:
# Your code code here

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [33]:
df2['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [8]:
# Your code code here

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [39]:
df3 = sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]
print(df3['TotalPayBenefits'])
print(df3['EmployeeName'])

0    567595.43
Name: TotalPayBenefits, dtype: float64
0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [9]:
# Your code code here

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

** What is the name of lowest paid person (including benefits)?**

In [41]:
df4 = sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]
print(df4)

            Id EmployeeName                    JobTitle  BasePay  OvertimePay  \
148653  148654    Joe Lopez  Counselor, Log Cabin Ranch      0.0          0.0

        OtherPay  Benefits  TotalPay  TotalPayBenefits  Year  Notes  \
148653   -618.13       0.0   -618.13           -618.13  2014    NaN

               Agency  Status
148653  San Francisco     NaN

In [161]:
#df4 = sal[sal.TotalPayBenefits == sal.TotalPayBenefits.min()]
df4 = sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

df4

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [10]:
# Your code code here
# First get the whole record of that person

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                     0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
Name: 148653, dtype: object

In [42]:
print(df4['EmployeeName'])

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [11]:
# Your code code here
# Display name

148653    Joe Lopez
Name: EmployeeName, dtype: object

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [47]:
import numpy as np

grouped = sal.groupby('Year')
grouped['BasePay'].agg(np.mean)

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [12]:
# Your code code here

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [49]:
sal['JobTitle'].nunique()

2159

In [128]:
sal.JobTitle.nunique()

2159

In [13]:
# Your code code here

2159

** What are the top 5 most common jobs? **

In [50]:
n = 5
sal['JobTitle'].value_counts()[:n].index.tolist()

['Transit Operator',
 'Special Nurse',
 'Registered Nurse',
 'Public Svc Aide-Public Works',
 'Police Officer 3']

In [53]:
df6 = sal['JobTitle'].value_counts()
df6.head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [14]:
# Your code code here

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [79]:
df2013 = sal[sal['Year'] == 2013]
df2013['JobTitle'].nunique()

1051

In [15]:
# Your code code here

202

** How many people have the word Chief in their job title? (This is pretty tricky) **
Hint : Create a function and use lambda expression

In [16]:
# Your code code here

In [106]:
df10 = sal[sal['JobTitle'].str.contains("Chief")]

# both work:
df10.drop_duplicates(subset=['EmployeeName','JobTitle'],keep='first')
df10['EmployeeName'].nunique()

313

In [17]:
# Your code code here

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [127]:
# Your code code here

# filter for Total Benefit = 0
sal2 = sal[sal['TotalPayBenefits'] > 0]

d2 = sal2['JobTitle'].apply(lambda x: len(x))
d2.corr(sal2['TotalPayBenefits'])

# pretty much no correlation -0.03 between job title lenght and Salary
# however, data woudl require more cleaning
#   - on duplicates
#   - on very low values (i would say that minimum of 10,000) (that reduces correlation to -0.01)

-0.03697631788929221

In [19]:
# Your code code here

           title_len
title_len        1.0

In [144]:
import pandas_profiling 

sal = pd.read_csv("Salaries.csv")
pandas_profiling.ProfileReport(sal)

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [142]:
sal = pd.read_csv("Salaries.csv")
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [143]:
sal2 = sal[sal['Year'].isin(['2013','2014'])]
sal2

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.00,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN
72926,72927,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0.00,23236.00,85431.39,336922.01,422353.40,2013,NaN,San Francisco,NaN
72927,72928,Samson Lai,"Battalion Chief, Fire Suppress",186236.42,131217.63,29648.27,57064.95,347102.32,404167.27,2013,NaN,San Francisco,NaN
72928,72929,Ellen G Moffatt,Asst Med Examiner,272855.51,23727.91,38954.54,66198.92,335537.96,401736.88,2013,NaN,San Francisco,NaN
72929,72930,Robert L Shaw,"Dep Dir for Investments, Ret",315572.01,0.00,0.00,82849.66,315572.01,398421.67,2013,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,NaN

# Great Job!

In [ ]:
wqsqwwd

In [145]:
import pandas_profiling 

df = pd.read_csv("nba.csv")
pandas_profiling.ProfileReport(df)

FileNotFoundError: [Errno 2] File nba.csv does not exist: 'nba.csv'

In [147]:
sal.select_dtypes(include=['number'])

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
0,1,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,NaN
1,2,155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,NaN
2,3,212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,NaN
3,4,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,NaN
4,5,134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
148649,148650,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,NaN
148650,148651,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,NaN
148651,148652,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,NaN
148652,148653,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,NaN
148653,148654,0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,NaN

In [151]:
counts = sal['TotalPay'].value_counts()

counts.nlargest(7)

0.0         368
18594.0      82
123290.7     56
132242.5     49
105489.0     42
50913.3      39
17085.0      39
Name: TotalPay, dtype: int64

In [152]:
counts.nlargest(7).index

Float64Index([0.0, 18594.0, 123290.7, 132242.5, 105489.0, 50913.3, 17085.0], dtype='float64')

In [155]:
sal.groupby('Year')['TotalPay'].mean()

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [157]:
 pd.cut(sal['TotalPay'], bins =[0,35000,70000,1000000], labels=['low','med','high'])

0         high
1         high
2         high
3         high
4         high
          ...
148649     NaN
148650     NaN
148651     NaN
148652     NaN
148653     NaN
Name: TotalPay, Length: 148654, dtype: category
Categories (3, object): [low < med < high]

In [159]:
sal['EmployeeName'].str.split(' ', expand=True)

                  0         1        2     3     4     5
0         NATHANIEL      FORD     None  None  None  None
1              GARY   JIMENEZ     None  None  None  None
2            ALBERT   PARDINI     None  None  None  None
3       CHRISTOPHER     CHONG     None  None  None  None
4           PATRICK   GARDNER     None  None  None  None
...             ...       ...      ...   ...   ...   ...
148649          Roy         I  Tillery  None  None  None
148650          Not  provided     None  None  None  None
148651          Not  provided     None  None  None  None
148652          Not  provided     None  None  None  None
148653          Joe     Lopez     None  None  None  None

[148654 rows x 6 columns]